MightyDevices/IN-12-Nixie-Clock/Code/stm32l/rcc.h
/* ahb peripheral */
#define AHB_GPIOA							(1 << 0)
#define AHB_GPIOB							(1 << 1)
#define AHB_GPIOC							(1 << 2)
#define AHB_GPIOD							(1 << 3)
#define AHB_GPIOE							(1 << 4)
#define AHB_GPIOH							(1 << 5)
#define AHB_GPIOF							(1 << 6)
#define AHB_GPIOG							(1 << 7)
#define AHB_CRC								(1 << 12)
#define AHB_FILTF							(1 << 15)
#define AHB_DMA1							(1 << 24)
#define AHB_DMA2							(1 << 25)
#define AHB_AES								(1 << 27)
#define AHB_FSMC							(1 << 30)

/* apb2 peripheral */
#define APB2_SYSCFG							(1 << 0)
#define APB2_TIM9							(1 << 2)
#define APB2_TIM10							(1 << 3)
#define APB2_TIM11							(1 << 4)
#define APB2_ADC1							(1 << 9)
#define APB2_SDIO							(1 << 11)
#define APB2_SPI1							(1 << 12)
#define APB2_USART1							(1 << 14)

/* apb1 peripheral */
#define APB1_TIM2							(1 << 0)
#define APB1_TIM3							(1 << 1)
#define APB1_TIM4							(1 << 2)
#define APB1_TIM5							(1 << 3)
#define APB1_TIM6							(1 << 4)
#define APB1_TIM7							(1 << 5)
#define APB1_LCD							(1 << 9)
#define APB1_WWDG							(1 << 11)
#define APB1_SPI2							(1 << 14)
#define APB1_SPI3							(1 << 15)
#define APB1_USART2							(1 << 17)
#define APB1_USART3							(1 << 18)
#define APB1_USART4							(1 << 19)
#define APB1_USART5							(1 << 20)
#define APB1_I2C1							(1 << 21)
#define APB1_I2C2							(1 << 22)
#define APB1_USB							(1 << 23)
#define APB1_PWR							(1 << 28)
#define APB1_DAC							(1 << 29)
#define APB1_COMP							(1 << 31)

/* ahb dividers */
#define AHB_DIV1							(0x00)
#define AHB_DIV2							(0x08)
#define AHB_DIV4							(0x09)
#define AHB_DIV8							(0x0a)
#define AHB_DIV16							(0x0b)
#define AHB_DIV64							(0x0c)
#define AHB_DIV128							(0x0d)
#define AHB_DIV256							(0x0e)
#define AHB_DIV512							(0x0f)

/* apb dividers */
#define APB_DIV1							(0x00)
#define APB_DIV2							(0x04)
#define APB_DIV4							(0x05)
#define APB_DIV8							(0x06)
#define APB_DIV16							(0x07)

/* clock sources */
#define SYSCLK_MSI							(0x00)
#define SYSCLK_HSI							(0x01)
#define SYSCLK_HSE							(0x02)
#define SYSCLK_PLL							(0x03)

/* rtc clock sources */
#define RCC_RTCCLKSOURCE_LSE             	RCC_CSR_RTCSEL_LSE
#define RCC_RTCCLKSOURCE_LSI             	RCC_CSR_RTCSEL_LSI
#define RCC_RTCCLKSOURCE_HSE_DIV2        	RCC_CSR_RTCSEL_HSE
#define RCC_RTCCLKSOURCE_HSE_DIV4        	(RCC_CSR_RTCSEL_HSE | RCC_CR_RTCPRE_0)
#define RCC_RTCCLKSOURCE_HSE_DIV8        	(RCC_CSR_RTCSEL_HSE | RCC_CR_RTCPRE_1)
#define RCC_RTCCLKSOURCE_HSE_DIV16       	(RCC_CSR_RTCSEL_HSE | RCC_CR_RTCPRE)

/* pll source */
#define RCC_PLLSOURCE_HSI                	0x000000
#define RCC_PLLSOURCE_HSE                	0x010000

/* pll multipliers */
#define RCC_PLLMUL_3                     	0x00000000
#define RCC_PLLMUL_4                     	0x00040000
#define RCC_PLLMUL_6                     	0x00080000
#define RCC_PLLMUL_8                     	0x000C0000
#define RCC_PLLMUL_12                    	0x00100000
#define RCC_PLLMUL_16                    	0x00140000
#define RCC_PLLMUL_24                    	0x00180000
#define RCC_PLLMUL_32                    	0x001C0000
#define RCC_PLLMUL_48                    	0x00200000

/* pll divider */
#define RCC_PLLDIV_2                     	0x00400000
#define RCC_PLLDIV_3                     	0x00800000
#define RCC_PLLDIV_4                     	0x00C00000

/* mco source */
#define RCC_MCOSOURCE_NOCLOCK            	0x00000000
#define RCC_MCOSOURCE_SYSCLK             	0x01000000
#define RCC_MCOSOURCE_HSI                	0x02000000
#define RCC_MCOSOURCE_MSI               	0x03000000
#define RCC_MCOSOURCE_HSE                	0x04000000
#define RCC_MCOSOURCE_PLLCLK             	0x05000000
#define RCC_MCOSOURCE_LSI                	0x06000000
#define RCC_MCOSOURCE_LSE                	0x07000000

/* mco div */
#define RCC_MCODIV_1                     	0x00000000
#define RCC_MCODIV_2                    	0x10000000
#define RCC_MCODIV_4                     	0x20000000
#define RCC_MCODIV_8                     	0x30000000
#define RCC_MCODIV_16                    	0x40000000

/* Resets the RCC clock configuration to the default reset state. */
void RCC_DeInit(void);
/* Configures the Internal Multi Speed oscillator (MSI) clock range. */
void RCC_MSIRangeConfig(int rng);
/* enable disable msi */
void RCC_MSICmd(int state);
/* get status of msi clock */
int RCC_GetMSIStatus(void);
/* enable/disable hsi */
void RCC_HSICmd(int state);
/* get status of hsi clock */
int RCC_GetHSIStatus(void);
/* enable/disable hse */
void RCC_HSECmd(int state);
/* get status of hse clock */
int RCC_GetHSEStatus(void);
/* enable/disable lsi */
void RCC_LSICmd(int state);
/* get status of hsi clock */
int RCC_GetLSIStatus(void);
/* enable/disable pll */
void RCC_PLLCmd(int state);
/* get status of pll clock */
int RCC_GetPLLStatus(void);

/* select clock */
void RCC_SYSCLKConfig(uint32_t source);

/* enables or disables ahb clock */
void RCC_AHBPeriphClockCmd(uint32_t ahb_periph, int state);
/* enables or disables apb2 clock */
void RCC_APB1PeriphClockCmd(uint32_t apb1_periph, int state);
/* enables or disables apb2 clock */
void RCC_APB2PeriphClockCmd(uint32_t apb2_periph, int state);

/* enables or disables ahb clock */
void RCC_AHBPeriphClockLPCmd(uint32_t ahb_periph, int state);
/* enables or disables apb2 clock */
void RCC_APB1PeriphClockLPCmd(uint32_t apb1_periph, int state);
/* enables or disables apb2 clock */
void RCC_APB2PeriphClockLPCmd(uint32_t apb2_periph, int state);

/* enables or disables ahb clock */
void RCC_AHBPeriphResetCmd(uint32_t ahb_periph, int state);
/* enables or disables apb2 clock */
void RCC_APB1PeriphResetCmd(uint32_t apb1_periph, int state);
/* enables or disables apb2 clock */
void RCC_APB2PeriphResetCmd(uint32_t apb2_periph, int state);

/* Configures the AHB clock (HCLK). */
void RCC_HCLKConfig(uint32_t sysclk);
/* Configures the AHB clock (HCLK). */
void RCC_PCLK1Config(uint32_t pclk);
/* Configures the AHB clock (HCLK). */
void RCC_PCLK2Config(uint32_t pclk);

/* get clocks freq */
void RCC_GetClocksFreq(rcc_clocks_t* clocks);

/* select rtc clock source */
void RCC_RTCCLKConfig(uint32_t source);
/* Enables or disables the RTC clock.*/
void RCC_RTCCLKCmd(int state);
/* Forces or releases the RTC peripheral and associated resources reset */
void RCC_RTCResetCmd(int state);

/* configure pll */
void RCC_PLLConfig(uint32_t pll_source, uint32_t mul, uint32_t div);
/* configure mco output */
void RCC_MCOConfig(uint32_t source, uint32_t div);
/* adjust hci trimming */
void RCC_AdjustHSICalibrationValue(uint8_t hsi_trimming);
/* adjust msi trimming */
void RCC_AdjustMSICalibrationValue(uint8_t msi_trimming);

#endif /* STM32_RCC_H_ */
